/*
*
*   first array value -> determines consonant prefix (row)
*   second array value -> determines the wovel (column)
*   third array value -> determines writing type (roumaji/hiragana/katakana)
*
*/

var monographs = [
	[["a", "あ", "ア"], ["i", "い", "イ"], ["u", "う", "ウ"], ["e", "え", "エ"], ["o", "お", "オ"]],
	[["ka", "か", "カ"], ["ki", "き", "キ"], ["ku", "く", "ク"], ["ke", "け", "ケ"], ["ko", "こ", "コ"]],
	[["sa", "さ", "サ"], ["shi", "し", "シ"], ["su", "す", "ス"], ["se", "せ", "セ"], ["so", "そ", "ソ"]],
	[["ta", "た", "タ"], ["chi", "ち", "チ"], ["tsu", "つ", "ツ"], ["te", "て", "テ"], ["to", "と", "ト"]],
	[["na", "な", "ナ"], ["ni", "に", "ニ"], ["nu", "ぬ", "ヌ"], ["ne", "ね", "ネ"], ["no", "の", "ノ"]],
	[["ha", "は", "ハ"], ["hi", "ひ", "ヒ"], ["fu", "ふ", "フ"], ["he", "へ", "ヘ"], ["ho", "ほ", "ホ"]],
	[["ma", "ま", "マ"], ["mi", "み", "ミ"], ["mu", "む", "ム"], ["me", "め", "メ"], ["mo", "も", "モ"]],
	[["ya", "や", "ヤ"], ["", "", ""], ["yu", "ゆ", "ユ"], ["", "", ""], ["yo", "よ", "ヨ"]],
	[["ra", "ら", "ラ"], ["ri", "り", "リ"], ["ru", "る", "ル"], ["re", "れ", "レ"], ["ro", "ろ", "ロ"]],
	[["wa", "わ", "ワ"], ["", "", ""], ["", "", ""], ["", "", ""], ["o/wo", "を", "ヲ"]],
	[["n", "ん", "ン"]]
];

var digraphs = [
	[["kya", "きゃ", "キャ"], ["kyu", "きゅ", "キュ"], ["kyo", "きょ", "キョ"]],
	[["sha", "しゃ", "シャ"], ["shu", "しゅ", "シュ"], ["sho", "しょ", "ショ"]],
	[["cha", "ちゃ", "チャ"], ["chu", "ちゅ", "チュ"], ["cho", "ちょ", "チョ"]],
	[["nya", "にゃ", "ニャ"], ["nyu", "にゅ", "ニュ"], ["nyo", "にょ", "ニョ"]],
	[["hya", "ひゃ", "ヒャ"], ["hyu", "ひゅ", "ヒュ"], ["hyo", "ひょ", "ヒョ"]],
	[["mya", "みゃ", "ミャ"], ["myu", "みゅ", "ミュ"], ["myo", "みょ", "ミョ"]],
	[["rya", "りゃ", "リャ"], ["ryu", "りゅ", "リュ"], ["ryo", "りょ", "リョ"]]
];

var digraphs_with_diacritics = [
	[["gya", "ぎゃ", "ギャ"], ["gyu", "ぎゅ", "ギュ"], ["gyo", "ぎょ", "ギョ"]],
	[["ja", "じゃ", "ジャ"], ["ju", "じゅ", "ジュ"], ["jo", "じょ", "ジョ"]],
	[["ja*", "ぢゃ", "ヂャ"], ["ju*", "ぢゅ", "ヂュ"], ["jo*", "ぢょ", "ヂョ"]],
	[["bya", "びゃ", "ビャ"], ["byu", "びゅ", "ビュ"], ["byo", "びょ", "ビョ"]],
	[["pya", "ぴゃ", "ピャ"], ["pyu", "ぴゅ", "ピュ"], ["pyo", "ぴょ", "ピョ"]]
];

var monographs_with_diacritics = [
	[["ga", "が", "ガ"], ["gi", "ぎ", "ギ"], ["gu", "ぐ", "グ"], ["ge", "げ", "ゲ"], ["go", "ご", "ゴ"]],
	[["za", "ざ", "ザ"], ["ji", "じ", "ジ"], ["zu", "ず", "ズ"], ["ze", "ぜ", "ゼ"], ["zo", "ぞ", "ゾ"]],
	[["da", "だ", "ダ"], ["ji*", "ぢ", "ヂ"], ["zu*", "づ", "ヅ"], ["de", "で", "デ"], ["do", "ど", "ド"]],
	[["ba", "ば", "バ"], ["bi", "び", "ビ"], ["bu", "ぶ", "ブ"], ["be", "べ", "ベ"], ["bo", "ぼ", "ボ"]],
	[["pa", "ぱ", "パ"], ["pi", "ぴ", "ピ"], ["pu", "ぷ", "プ"], ["pe", "ぺ", "ペ"], ["po", "ぽ", "ポ"]]
];

var hiraganaChart = [
  {
    "romaji":"a",
      "a":"あ",
      "i":"い",
      "u":"う",
      "e":"え",
      "o":"お"
  },
  {
    "romaji": "k",
    "ka":"か",
    "ki":"き",
    "ku":"く",
    "ke":"け",
    "ko":"こ"
  },
  {
    "romaji":"s",
    "sa":"さ",
    "shi":"し",
    "su":"す",
    "se":"せ",
    "so":"そ",
  },
  {
    "romaji":"t",
    "ta":"た",
    "chi":"ち",
    "tsu":"つ",
    "te":"て",
    "to":"と",
  },
  {
    "romaji":"n",
    "na":"な",
    "ni":"に",
    "nu":"ぬ",
    "ne":"ね",
    "no":"の",
  },

  {
    "romaji":"h",
    "ha":"は",
    "hi":"ひ",
    "fu":"ふ",
    "he":"へ",
    "ho":"ほ"
  },

  {
    "romaji":"m",
    "ma":"ま",
    "mi":"み",
    "mu":"む",
    "me":"め",
    "mo":"も",
  },
  {
    "romaji":"y",
    "ya":"や",
    "yu":"ゆ",
    "yo":"よ",
  },
  {
    "romaji":"r",
    "ra":"ら",
    "ri":"り",
    "ru":"る",
    "re":"れ",
    "ro":"ろ",
  },
  {
    "romaji":"w",
      "wa":"わ",
      "wo":"を",
  },
  {
    "romaji":"'n'",
    "'n'":"ん",
  }
];

var yoonHiragana = [
  {
    "romaji":"ki",
    "kya":"きゃ",
    "kyu":"きゅ",
    "kyo":"きょ",
  },

  {
    "romaji":"shi",
    "sha":"しゃ",
    "shu":"しゅ",
    "sho":"しょ"
  },

  {
    "romaji":"chi",
    "cha":"ちゃ",
    "chu":"ちゅ",
    "cho":"ちょ",
  },

  {
    "romaji":"ni",
    "nya":"にゃ",
    "nyu":"にゅ",
    "nyo":"にょ",
  },

  {
    "romaji":"hi",
    "hya":"ひゃ",
    "hyu":"ひゅ",
    "hyo":"ひょ",
  },

  {
    "romaji":"mi",
    "mya":"みゃ",
    "myu":"みゅ",
    "myo":"みょ",
  },

  {
    "romaji":"ri",
    "rya":"りゃ",
    "ryu":"りゅ",
    "ryo":"りょ",
  },
  {
    "romaji":"gi",
    "gya":"ぎゃ",
    "gyu":"ぎゅ",
    "gyo":"ぎょ",
  },
  {
    "romaji":"zji",
    "zjia":"じゃ",
    "zjiu":"じゅ",
    "zjio":"じょ",
  },
  {
    "romaji":"dji",
    "dja":"ぢゃ",
    "dju":"ぢゅ",
    "djo":"ぢょ",
  },
  {
    "romaji":"bi",
    "bya":"びゃ",
    "byu":"びゅ",
    "byo":"びょ",
  },
  {
    "romaji":"pi",
    "pya":"ぴゃ",
    "pyu":"ぴゅ",
    "pyo":"ぴょ",
  },
];

var dakuonHiragana = [
  {
    "romaji":"g",
    "ga":"が",
    "gi":"ぎ",
    "gu":"ぐ",
    "ge":"げ",
    "go":"ご",
  },
  {
    "romaji":"z",
    "za":"ざ",
    "ji":"じ",
    "zu":"ず",
    "ze":"ぜ",
    "zo":"ぞ",
  },
  {
    "romaji":"d",
    "da":"だ",
    "dji":"ぢ",
    "dzu":"づ",
    "de":"で",
    "do":"ど",
  },
  {
    "romaji":"b",
    "ba":"ば",
    "bi":"び",
    "bu":"ぶ",
    "be":"べ",
    "bo":"ぼ",
  },
  {
    "romaji":"p",
    "pa":"ぱ",
    "pi":"ぴ",
    "pu":"ぷ",
    "pe":"ぺ",
    "po":"ぽ",
  },
];

export {
  hiraganaChart,
  yoonHiragana,
  dakuonHiragana,

};
